/* eslint-disable class-methods-use-this */

import React from 'react';
import BasePage from '../../../lib/base/page/page.jsx';

import './style.less';

export default class PrivacyPolicyPage extends BasePage
{
    getPageTitle()
    {
        return 'Согласие на обработку персональных данных';
    }

	render()
	{
		return (
            <div
                className="article-detail page-content"
            >
                <div className="article-detail__inner-scroll">
                    <div className="padding_x padding-l_x2">

                        <h2>1. Согласие на обработку персональных данных</h2>

                        <p>Физическое лицо (далее &ndash; Пользователь) , отправляя форму на веб-странице веб-сайта nachberlin.ru, (далее &ndash; Веб-сайт), обязуется принять настоящее Согласие на обработку персональных данных (далее &ndash; Согласие). Принятием Согласия является отправка формы на Веб-сайте. Действуя свободно, своей волей и в своем интересе, а также подтверждая свою дееспособность, физическое лицо дает свое согласие Администрации Веб-сайта (далее &ndash; Оператор) на обработку своих персональных данных со следующими условиями:</p>

                        <p>&nbsp;</p>

                        <ol>
                            <li>Согласие дается на обработку персональных данных, как без использования средств автоматизации, так и с их использованием.</li>
                            <li>Согласие дается на обработку следующих персональных данных</li>
                            <li>Персональные данные, не являющиеся специальными или биометрическими: имя; адрес электронной почты; адреса контактных телефонов; сведения о почтовом клиенте; сведения об используемом браузере; сведения о переходах по ссылкам в электронных письмах; сведения о месторасположении; сведения об IP-адресах, с которых пользователь открывает электронное письмо.</li>
                            <li>Персональные данные не являются общедоступными.</li>
                            <li>Цель обработки персональных данных: повышение степени интегрированности Веб-сайта с различными социальными сервисами, в частности, "ВКонтакте" и "Facebook", обратная связь с Пользователем.</li>
                            <li>В ходе обработки с персональными данными будут совершены следующие действия: сбор; запись; систематизация; накопление; хранение; уточнение (обновление, изменение); извлечение; использование; блокирование; удаление; уничтожение.</li>
                            <li>Третьи лица не обрабатывают персональные данные по поручению Оператора.</li>
                            <li>Персональные данные обрабатываются до уведомления субъектом персональных данных о желании отозвать согласие на обработку своих персональных данных.</li>
                            <li>Согласие может быть отозвано субъектом персональных данных или его представителем путем направления заявления Оператору или его представителю по электронному адресу info@nachberlin.ru.</li>
                            <li>В случае отзыва субъектом персональных данных или его представителем согласия на обработку персональных данных Оператор вправе продолжить обработку персональных данных без согласия субъекта персональных данных при наличии оснований, указанных в пунктах 2 &ndash; 11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального закона №152-ФЗ &laquo;О персональных данных&raquo; от 27.07.2006 г.</li>
                            <li>Согласие действует все время до момента прекращения обработки персональных данных, указанных в пунктах 1.8 и 1.9 Согласия.</li>
                        </ol>

                        <h2>2. Файлы Cookie и иные средства отслеживания действий пользователя</h2>

                        <p>Веб-сайт, а также иные средства отслеживания действий посетителя (далее &ndash; Иные средства), функциональные модули которых расположены на страницах Веб-сайта, могут использовать файлы Cookie (далее &ndash; Cookie) и LocalStorage (далее &ndash; Локальное хранилище). В случае использования Пользователем Веб-сайта, Пользователь автоматически подтверждает свое согласие на размещение Cookie и Локального хранилища на своем компьютере (далее &ndash; Согласие), планшете или мобильном телефоне (далее &ndash; Устройстве) Оператором, а также Иными средствами на следующих условиях:</p>

                        <ol>
                            <li>Пользователь ознакомлен с принципами работы технологий Cookie и Локального хранлища, их возможностями и ограничениями,</li>
                            <li>Пользователю ясны задачи, для реализации которых Оператор использует Cookie и Локальное хралищие, а именно:
                                <ol>
                                    <li>Идентификация Пользователя,</li>
                                    <li>Улучшение работы Веб-Сайта путем:
                                        <ol>
                                            <li>анализа действий Пользователя при его нахождении на страницах Веб-сайта,</li>
                                            <li>моделирования событий, происходящих на страницах Веб-сайта, в частности, появления ошибок, сбоев в работе Веб-сайта,</li>
                                            <li>тестирования различных элементов дизайна и функциональных модулей Веб-сайта,</li>
                                        </ol>
                                    </li>
                                    <li>Кратковременное хранение данных, введенных Пользователем в поля форм на страницах Веб-сайта с целью предотвращения их потери при сбое в работе и\или случайном закрытии страницы Веб-сайта на Устройстве,</li>
                                    <li>Реализация взаимодействия между функциональными модулями Веб-сайта и иными сервисами, в частности, социальными сервисами "ВКонтакте" и "Facebook". При этом данные сервисы в праве частично или полностью использовать информацию, содержащуюся в Cookie или Локальном хранилище по своем собственному усмотрению в рамках действующего законодательства,</li>
                                </ol>
                            </li>
                            <li>Оператор не может использовать Cookie и Локальное хранилище каким либо иным способом, указанным в пункте 2.2 данного Согласия,</li>
                            <li>Во время первого посещения Пользователем Веб-сайта, Cookie и записи в Локальном хранилище могут быть созданы автоматически,</li>
                            <li>В случае, если Пользователь не намерен предоставлять свое Согласие, он обязан прекратить дальнейшее использование Веб-сайта и отключить работу Cookie и Локального хранилища на своем Устройстве для данного Веб-сайта,</li>
                            <li>Пользователь подтвержает фак ознакомления со следующими последствиями отключения Cookie и\или Локального хранилища:
                                <ol>
                                    <li>отключение Cookie и\или Локального хранилища повлияет на работоспособность страниц Веб-сайта на Устройстве,</li>
                                    <li>Пользователь может оказаться не в состояни воспользоваться некоторыми страницами Веб-сайта, а также в полном объеме всей функциональностью, реализуемой Веб-сайтом,</li>
                                </ol>
                            </li>

                            <li>Пользователь в праве отозвать свое Согласие в любое время путем выполнения действий, описанных в пункте 2.5 данного Согласия,</li>
                            <li>Веб-сайт не поддерживает работу системы DNT ("do-not-track"),</li>
                        </ol>
                        <h2>3. Обратная связь</h2>
                        Все вопросы, которые могут возникнуть у Пользователя, последний может направлять на электронный адрес info@nachberlin.ru

                    </div>
                </div>
            </div>
        );
	}
}
